Управление_торговлей.ПБТ/src/Documents/ПротоколАнализа/ПротоколАнализа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПротоколАнализа</name>
  <basedOn>Document.ПротоколАнализа</basedOn>
  <registerRecords>AccumulationRegister.ОтборОбразцов</registerRecords>
  <registerRecords>InformationRegister.СтатусыОбразцов</registerRecords>
  <attributes>
    <name>ВидИсследования</name>
    <type>
      <types>CatalogRef.ВидыИсследований</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзготовления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DocumentRef.ПротоколАнализа</types>
      <types>DocumentRef.АктПриемаОбразцов</types>
    </type>
  </attributes>
  <attributes>
    <name>ДокументПоступления</name>
    <type>
      <types>DocumentRef.АктОтбора</types>
    </type>
  </attributes>
  <attributes>
    <name>КодПродукта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>14</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Производитель</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Лаборатория</name>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗамеса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусРезультатаИсследований</name>
    <type>
      <types>EnumRef.СтатусРезультатаИсследований</types>
    </type>
  </attributes>
  <attributes>
    <name>Поставщик</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПоступленияНаСклад</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляПечати</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыводитьАттестат</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>АдресЗаявителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УсловияДоставки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставкиОбразца</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоставкиОбразца</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МассаОбразца</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Направление</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЦельИсследования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СопроводительныеДокументы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Заключение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОтветственныйЗаЗаключение</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НоменклатурнаяГруппаЛаб</name>
    <comment>(Общ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ППК</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Серия</name>
    <type>
      <types>CatalogRef.СерииНоменклатуры</types>
    </type>
  </attributes>
  <attributes>
    <name>КомментарийДляКартыРазрешения</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Заявка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаЗадержки</name>
    <comment>Причина задержки по заявке</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Разработки</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВИСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Образец</name>
    <type>
      <types>CatalogRef.ЛабораторныйОбразец</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧ_Показатели</name>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>CatalogRef.Нормативы</types>
      </type>
    </attributes>
    <attributes>
      <name>Статус</name>
      <comment>Только для органолептики</comment>
      <type>
        <types>EnumRef.СтатусРезультатаИсследований</types>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <type>
        <types>UUID</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПоТУ</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВариантСравнения</name>
      <type>
        <types>EnumRef.ВариантыСравнения</types>
      </type>
    </attributes>
    <attributes>
      <name>Интервал</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>20</precision>
          <scale>6</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Погрешность</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>8</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИныеПоказатели</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаУстановкиСтатуса</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧ_ГОСТ</name>
    <comment>0013820</comment>
    <attributes>
      <name>ГОСТ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиТЧ_Показатели</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧ_ГОСТ_погрешность</name>
    <comment>0013820</comment>
    <attributes>
      <name>ГОСТ</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторСтрокиТЧ_Показатели</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Погрешность</name>
      <type>
        <types>CatalogRef.ПогрешностиПоГостам</types>
      </type>
    </attributes>
    <attributes>
      <name>Использовать</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Управление_торговлей.ПБТ/src/Enums/СтатусРезультатаИсследований/СтатусРезультатаИсследований.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусРезультатаИсследований</name>
  <enumValues>
    <name>соответствует</name>
  </enumValues>
  <enumValues>
    <name>несоответствует</name>
  </enumValues>
  <enumValues>
    <name>брак</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяДополнительноеИсследование</name>
  </enumValues>
  <enumValues>
    <name>ТребуетсяВыводСотрудникаЦПБ</name>
  </enumValues>
</mdclass:Enum>

Управление_торговлей.ПБТ/src/Documents/ПротоколАнализа/Forms/ФормаДокумента/Module.bsl
&НаСервереБезКонтекста
Процедура НоменклатураНачалоВыбораНаСервере()
	// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	//НоменклатураНачалоВыбораНаСервере();
	ПараметрыОткрытияФормы = Новый Структура("Уникальность, Окно, НавигационнаяСсылка, Владелец", Ложь);
	
	ОповещениеОЗакрытие = Новый ОписаниеОповещения("ПослеЗакрытияФормыВыбораНоменклатуры", ЭтотОбъект);
	
	ПараметрыФормы = Новый Структура("ВидИсследования, Лаборатория, Дата", Объект.ВидИсследования, Объект.Лаборатория, Объект.Дата);
	
	ОткрытьФорму("Документ.ПротоколАнализа.Форма.ФормаВыбораНоменклатуры", ПараметрыФормы,
	ПараметрыОткрытияФормы.Владелец, ПараметрыОткрытияФормы.Уникальность,
	ПараметрыОткрытияФормы.Окно, ПараметрыОткрытияФормы.НавигационнаяСсылка, ОповещениеОЗакрытие);
	
КонецПроцедуры

//&НаКлиенте
&НаСервере
Процедура ПослеЗакрытияФормыВыбораНоменклатуры(СтрукПараметров, ДополнительныеПараметры) Экспорт
	
	Если СтрукПараметров = Неопределено Тогда
		Возврат;
	КонецЕсли; 
	Если СтрукПараметров.Свойство("Номенклатура") Тогда
		Объект.Номенклатура = СтрукПараметров.Номенклатура;
		Объект.Образец = СтрукПараметров.Образец;
		Объект.КодПродукта = СтрукПараметров.Образец.КодПродукта;
		Объект.ДокументПоступления = СтрукПараметров.Образец.ДокументПоступления;
	КонецЕсли; 
	
	Если НЕ Объект.ВидИсследования.Пустая() Тогда
		ЗаполнитьТаблицуПоказателей();
	КонецЕсли; 	
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТаблицуПоказателей()
	
	Если Объект.Заявка Тогда 
		
		Объект.ТЧ_Показатели.Очистить();
		Объект.ТЧ_ГОСТ.Очистить();
		Объект.ТЧ_ГОСТ_погрешность.Очистить();
		
		Если НЕ ЗначениеЗаполнено(Объект.ДокументПоступления) Тогда
			Возврат;
		КонецЕсли;	
		//находим выбранные показатели в самом акте отбора
		СтрОбразцов = Объект.ДокументПоступления.ТЧ_Образцы.Найти(Объект.Номенклатура, "Номенклатура");		
		Если СтрОбразцов = Неопределено Тогда
			Возврат;
		КонецЕсли; 
		
		//находим строку из видов исследований
		Отбор1 = Новый Структура();
		Отбор1.Вставить("НомерСтрокиТЧОбразцы", СтрОбразцов.НомерСтроки);
		Отбор1.Вставить("ВидИсследования", Объект.ВидИсследования);
		
		СтрокиВИ = Объект.ДокументПоступления.ТЧ_ВидыИсследований.НайтиСтроки(Отбор1);		
		Если СтрокиВИ.Количество()=0 Тогда
			Возврат;
		КонецЕсли;	
		СтрокаВИ = СтрокиВИ[0];
		//находим строку из Показатели
		Отбор1 = Новый Структура();
		Отбор1.Вставить("ИдентификаторСтрокиТЧИсследований", СтрокаВИ.ИдентификаторСтроки);
		//Отбор1.Вставить("ВидИсследования",ВидИсследования);
		Отбор1.Вставить("Выбор", Истина);
		
		СтрокиПок = Объект.ДокументПоступления.Показатели.НайтиСтроки(Отбор1);		
		Если СтрокиПок.Количество()=0 Тогда
			Возврат;
		КонецЕсли;
		
		лТЗНормативы = Лаборатория_Сервер.гл_ПолучитьТаблицуНормативов(Объект.Номенклатура, Объект.ВидИсследования,,Объект.Дата, Объект.Поставщик);
		
		Для каждого Стр Из СтрокиПок Цикл
			лСтрокаТЧПоказатели = Объект.ТЧ_Показатели.Добавить();
			ЗаполнитьЗначенияСвойств(лСтрокаТЧПоказатели, Стр,,"НомерСтроки");
			
			
			лСтрокаТЧПоказатели.ИдентификаторСтроки = Строка(Новый УникальныйИдентификатор);
			
			//заполняем данными из норматива
			лСтрокаТЗНормативы = лТЗНормативы.Найти(лСтрокаТЧПоказатели.Показатель, "Показатель");
			Если НЕ лСтрокаТЗНормативы = Неопределено Тогда
				//лСтрокаТЧПоказатели.Значение = ?(лСтрокаТЗНормативы.Показатель.ТипЗначения = 0, 0, "");//лСтрокаТЧПоказатели.Показатель.ТипЗначения.ПривестиЗначение(лСтрокаТЧПоказатели.Значение);			
				лСтрокаТЧПоказатели.Значение = лСтрокаТЗНормативы.Значение; 
				лСтрокаТЧПоказатели.ЕдиницаИзмерения = лСтрокаТЗНормативы.ЕдиницаИзмерения;
				лСтрокаТЧПоказатели.ЗначениеПоТУ = лСтрокаТЗНормативы.Значение; 
				лСтрокаТЧПоказатели.ВариантСравнения = лСтрокаТЗНормативы.ВариантСравнения; 
				лСтрокаТЧПоказатели.Интервал = лСтрокаТЗНормативы.Интервал;	
			Иначе
				лСтрокаТЧПоказатели.Значение = "";
			КонецЕсли; 
		КонецЦикла;
	Иначе
		
		//Если Вопрос("Заполнить таблицу показателей?" + Символы.ПС + "Перед заполнением таблица будет очищена.", РежимДиалогаВопрос.ДаНет, ,КодВозвратаДиалога.Да, "Учет образцов") = КодВозвратаДиалога.Да Тогда 
			Объект.ТЧ_Показатели.Очистить();
			Объект.ТЧ_ГОСТ.Очистить();
			Объект.ТЧ_ГОСТ_погрешность.Очистить();
			//Заполнение табличной части
			лТЗНормативы = Лаборатория_Сервер.гл_ПолучитьТаблицуНормативов(Объект.Номенклатура, Объект.ВидИсследования,,Объект.Дата, Объект.Поставщик);	
			лПредПоказатель = "";
			Для каждого лСтрокаТЗНормативы Из лТЗНормативы Цикл
				Если НЕ лСтрокаТЗНормативы.Показатель = лПредПоказатель Тогда
					лСтрокаТЧПоказатели = Объект.ТЧ_Показатели.Добавить();
					лСтрокаТЧПоказатели.Показатель = лСтрокаТЗНормативы.Показатель;
					//Если лСтрокаТЗНормативы.Показатель.ТипЗначения = 1 Тогда
					//     лСтрокаТЧПоказатели.Показатель.ТипЗначения.ПривестиЗначение("");			
					//Иначе	
					//     лСтрокаТЧПоказатели.Показатель.ТипЗначения.ПривестиЗначение(0);			
					//КонецЕсли; 
					лСтрокаТЧПоказатели.Значение = ?(лСтрокаТЗНормативы.Показатель.ТипЗначения = 0, 0, "");//
					//лСтрокаТЧПоказатели.Значение = лСтрокаТЗНормативы.Значение; 
					лСтрокаТЧПоказатели.ЕдиницаИзмерения = лСтрокаТЗНормативы.ЕдиницаИзмерения;
					//Если Объект.ВидИсследования = Справочники.ВидыИсследований.Органолептика Тогда
					//	лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.соответствует; 
					//КонецЕсли;
					лПредПоказатель = лСтрокаТЗНормативы.Показатель;
					
					лСтрокаТЧПоказатели.ИдентификаторСтроки = Новый УникальныйИдентификатор; 
					лСтрокаТЧПоказатели.ЗначениеПоТУ = лСтрокаТЗНормативы.Значение; 
					
					лСтрокаТЧПоказатели.ВариантСравнения = лСтрокаТЗНормативы.ВариантСравнения; 
					лСтрокаТЧПоказатели.Интервал = лСтрокаТЗНормативы.Интервал; 
					
					Показатель = лСтрокаТЧПоказатели.Показатель;
					Для каждого СтрГост Из Показатель.МетодыИсследований Цикл
						лСтрокаТЧГОСТ = Объект.ТЧ_ГОСТ_погрешность.Добавить();
						лСтрокаТЧГОСТ.ИдентификаторСтрокиТЧ_Показатели = лСтрокаТЧПоказатели.ИдентификаторСтроки;
						лСтрокаТЧГОСТ.ГОСТ = СтрГост.МетодИсследования;
						лСтрокаТЧГОСТ.Погрешность = СтрГост.Погрешность;
						лСтрокаТЧГОСТ.Использовать = (Показатель.МетодыИсследований.Количество() = 1);
						
						Если лСтрокаТЧГОСТ.Использовать Тогда
							//лСтрокаТЧПоказатели.Погрешность = Лаборатория_Сервер.РассчитатьПогрешность(лСтрокаТЧГОСТ.Погрешность, лСтрокаТЧПоказатели.Значение);
						КонецЕсли;					
					КонецЦикла; 
					//brava 0013820
				КонецЕсли; 
				//лСтрокаТЧГОСТ = ТЧ_ГОСТ.Добавить();
				//лСтрокаТЧГОСТ.НомерСтрокиТЧ_Показатели = лСтрокаТЧПоказатели.НомерСтроки;
				//лСтрокаТЧГОСТ.ГОСТ = лСтрокаТЗНормативы.ГОСТ;
			КонецЦикла; 
		//КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ПоказателиЗначениеПриИзменении(Элемент)
	
	//лСтрокаТЧПоказатели = Элементы.ТЧ_Показатели.ТекущиеДанные;

	//ПараметрыОтбора = Новый Структура;
	//ПараметрыОтбора.Вставить("ИдентификаторСтрокиТЧ_Показатели", лСтрокаТЧПоказатели.ИдентификаторСтроки);
	//ПараметрыОтбора.Вставить("Использовать", Истина);
	//
	//СтрокиГОСТ = Объект.ТЧ_ГОСТ_погрешность.НайтиСтроки(ПараметрыОтбора);
	//Если СтрокиГОСТ.Количество()>0 Тогда
	//	лСтрокаТЧГОСТ = СтрокиГОСТ[0];
	//	лСтрокаТЧПоказатели.Погрешность = Лаборатория_Сервер.РассчитатьПогрешность(лСтрокаТЧГОСТ.Погрешность, лСтрокаТЧПоказатели.Значение);
	//КонецЕсли; 
	//
	////0022744
	////Если лСтрокаТЧПоказатели.Значение = "Не аналогично эталону" Тогда
	////	лСтрокаТЧПоказатели.Статус = Перечисления.СтатусРезультатаИсследований.несоответствует;
	////КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ПоказателиЗначениеНачалоВыбораИзСписка(Элемент, СтандартнаяОбработка)
	
	//Элемент.СписокВыбора.Очистить();
	//
	//Если Объект.ВидИсследования = ПредопределенноеЗначение("Справочник.ВидыИсследований.Органолептика") Тогда
	//	Элемент.СписокВыбора.Добавить("Соответствует");
	//	Элемент.СписокВыбора.Добавить("Не аналогично эталону");
	//	Элемент.СписокВыбора.Добавить("Не обнаружены");
	//ИначеЕсли Объект.ВидИсследования = ПредопределенноеЗначение("Справочник.ВидыИсследований.ФизикоХимическиеИсследования") Тогда
	//	Элемент.СписокВыбора.Добавить("Не обнаружены");	
	//ИначеЕсли Объект.ВидИсследования = ПредопределенноеЗначение("Справочник.ВидыИсследований.ФункциональныеСвойства") Тогда    
	//	Элемент.СписокВыбора.Добавить("Соответствует");
	//	ТекСтрока = Элементы.ТЧ_Показатели.ТекущиеДанные;
	//	Элемент.СписокВыбора.Добавить(ТекСтрока.ЗначениеПоТУ);
	//КонецЕсли; 
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	УстановитьСтатус();
	
	//Если Объект.СтатусРезультатаИсследований = ПредопределенноеЗначение("Перечисление.СтатусРезультатаИсследований.несоответствует") Тогда
	//	
	//	лТекстВопроса = "";
	//	//лТекстВопроса = "Обнаружены несоответствия нормативным данным по следующим показателям:";
	//	//Для каждого лЭлементСпискаНесоответствий Из Объект.лСписокПоказателейНесоответствия Цикл
	//	//	лТекстВопроса = лТекстВопроса + Символы.ПС + " - " + лЭлементСпискаНесоответствий.Значение;
	//	//КонецЦикла; 
	//	лТекстВопроса = лТекстВопроса + Символы.ПС + "Установить образцу статус ""Брак""?";
	//	Если Вопрос(лТекстВопроса, РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да, "Учет образцов") = КодВозвратаДиалога.Да Тогда 	
	//		//СтатусРезультатаИсследований = Перечисления.СтатусРезультатаИсследований.брак;
	//		Объект.СтатусРезультатаИсследований = ПредопределенноеЗначение("Перечисление.СтатусРезультатаИсследований.несоответствует");
	//	КонецЕсли;
	//	
	//КонецЕсли; 
	
	//brava 0011744
	//не даем провести такой протокол
	//Если СтатусРезультатаИсследований = Перечисления.СтатусРезультатаИсследований.ТребуетсяДополнительноеИсследование 
	//	ИЛИ СтатусРезультатаИсследований = Перечисления.СтатусРезультатаИсследований.ТребуетсяВыводСотрудникаЦПБ Тогда  //0023547
	//	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
	//		Отказ = Истина;
	//		Сообщить("Протокол с таким статусом нельзя проводить!");
	//	КонецЕсли; 
	//КонецЕсли; 
	
КонецПроцедуры

&НаСервере
Процедура УстановитьСтатус()
	
	Документы.ПротоколАнализа.УстановитьСтатус(Объект);	
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
		// Первоначальное заполнение объекта.
	Если Параметры.Ключ.Пустая() Тогда
		
		//Объект.Организация = Справочники.Организации.НайтиПоКоду("000000011"); 
		Объект.Пользователь = Пользователи.ТекущийПользователь(); 
		Объект.Дата = ТекущаяДатаСеанса(); 
		
	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура СоответствуетНаСервере()
	Для каждого Стр Из Объект.ТЧ_Показатели Цикл
		Стр.Значение = "Соответствует";
	КонецЦикла; 
КонецПроцедуры

&НаКлиенте
Процедура Соответствует(Команда)
	СоответствуетНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостью()

	//Если Объект.ВидИсследования = ПредопределенноеЗначение("Справочник.ВидыИсследований.Органолептика") Тогда
	//	Элементы.ТЧ_Показатели.КоманднаяПанель.ПодчиненныеЭлементы.ТЧ_ПоказателиСоответствует.Доступность = Истина;	
	//Иначе
	//	Элементы.ТЧ_Показатели.КоманднаяПанель.ПодчиненныеЭлементы.ТЧ_ПоказателиСоответствует.Доступность = Ложь;
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ВидИсследованияПриИзменении(Элемент)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УправлениеВидимостью();
КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ПоказателиЗначениеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	//СтандартнаяОбработка = Ложь;
	//ДанныеВыбора = Новый СписокЗначений;
	//
	////Если Объект.ВидИсследования = ПредопределенноеЗначение("Справочник.ВидыИсследований.Органолептика") Тогда
	//	ДанныеВыбора.Добавить("Соответствует");
	//	ДанныеВыбора.Добавить("Не аналогично эталону");
	//	ДанныеВыбора.Добавить("Не обнаружены");
	//ИначеЕсли Объект.ВидИсследования = ПредопределенноеЗначение("Справочник.ВидыИсследований.ФизикоХимическиеИсследования") Тогда
	//	ДанныеВыбора.Добавить("Не обнаружены");	
	//ИначеЕсли Объект.ВидИсследования = ПредопределенноеЗначение("Справочник.ВидыИсследований.ФункциональныеСвойства") Тогда    
	//	ДанныеВыбора.Добавить("Соответствует");
	//	ТекСтрока = Элементы.ТЧ_Показатели.ТекущиеДанные;
	//	ДанныеВыбора.Добавить(ТекСтрока.ЗначениеПоТУ);
	//КонецЕсли; 

КонецПроцедуры

&НаКлиенте
Процедура ТЧ_ПоказателиЗначениеОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ТекущаяСтрока = Элементы.ТЧ_Показатели.ТекущиеДанные;
	ТекущаяСтрока.Значение = ВыбранноеЗначение;	
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	Если Объект.СтатусРезультатаИсследований=ПредопределенноеЗначение("Перечисление.СтатусРезультатаИсследований.несоответствует") Тогда
		СоздатьКРПоПротоколу();
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура СоздатьКРПоПротоколу()
	Документы.ПротоколАнализа.СоздатьКРПоПротоколу(Объект.Ссылка);
КонецПроцедуры
